info = [
    {
        'назва': 'Урюпінськ',
        'заражені': 125_661,
        'одужало': 52_516,
        'померло': 10_245
    },
    {
        'назва': 'Заповінськ',
        'заражені': 32_661,
        'одужало': 42_516,
        'померло': 1_245
    },
    {
        'назва': 'Підпільск',
        'заражені': 100_120,
        'одужало': 32_112,
        'померло': 9_177
    },
    {
        'назва': 'Завалівськ',
        'заражені': 165_231,
        'одужало': 90_246,
        'померло': 21_245
    },
    {
        'назва': 'Окраїнськ',
        'заражені': 67_231,
        'одужало': 40_242,
        'померло': 5_212
    },
]


"""
Знайти загальну кількість заражених, одужавших, і померлих.
Також вивести на екран середню кількість заражених на місто.
"""
zar_count = 0
od_count = 0
pom_count = 0
cities_count = 0

for city_info in info:
    zar_count += city_info['заражені']
    od_count += city_info['одужало']
    pom_count += city_info['померло']
    cities_count += 1

ser_count = zar_count / cities_count

print(f'Всього заражено: {zar_count}\nВсього одужало: {od_count}\nВсього померло: {pom_count}')
print(f'Середня кількість заражених на місто: {ser_count}')
